configs/runs/hidden_bench_naming.yaml
# HiddenBench information structure under naming-game dyadic interaction.
#
# Same Hidden Profile task and the same fact wording as
# configs/runs/hidden_bench_vanilla.yaml; the discussion is replaced by private
# pairwise conversations with private per-partner memory. Defaults to the
# expanded (N > 4) population, because the dyadic structure only becomes
# interesting once there are more agents than evidence types.
#
# Cost: rounds * 2 * (messages_per_turn + 1) = 12 * 2 * 2 = 48 provider calls
# per episode before retries, and fewer if consensus stops it early.
llm_provider:
  type: university
  model: gwdg/qwen3-30b-a3b-instruct-2507
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  timeout_seconds: 60
  max_retries: 2
  request_concurrency: 8
  temperature: 0.0
  max_output_tokens: 512
  options:
    estimated_latency_seconds: 3.0
prompt:
  schema_version: 2
  # Switches by phase between hidden_bench_naming_message and
  # hidden_bench_naming_commit; the commitment is the decision-bearing family.
  prompt_family: hidden_bench_naming_commit
  prompt_version: 1
  message_mode: merge_consecutive_roles
  block_separator: "\n\n"
  response_contract:
    type: hidden_bench_json_vote
    allowed_values: [West City, East Town, North Hill]
game:
  type: hidden_bench_naming
  population_size: 5
  # Not used: the step count is rounds * (messages_per_turn + 1) = 24.
  horizon: 24
  topology: complete
  options:
    task_set: expanded
    task_id: evacuation_west_city
    n_agents: 5
    profile: hidden
    # exact_replication is the pipeline's own deterministic scheme: evidence
    # types are dealt round-robin, so with N=5 > C=4 one type is held twice.
    assignment_scheme: exact_replication
    rounds: 12
    messages_per_turn: 1 # `m` - messages each partner sends per round
    pairing: uniform_two_distinct # the hook for a graph/network topology
    memory_size: 0 # 0 = unbounded: remember every partner ever met
    # Prompt-level, not enforced: the game cannot stop a model from relaying.
    # true  = facts diffuse freely (a genuine information-diffusion process)
    # false = a fact travels at most one hop from a native holder
    allow_relay: true
    stop_on_consensus: true
    consensus_threshold: 0.95
    payoff:
      # coordination | correctness | coordination_plus_correctness.
      # `coordination` does not pay for being right, so convention formation
      # and truth-finding stay separable observables. All three quantities are
      # reported regardless of which one is paying.
      mode: coordination
      match_reward: 1.0
      mismatch_penalty: -1.0
      correctness_bonus: 0.5
    extra_prompt: null
    dissenter_extra_prompt: null
    dissenter_fraction: 0.0
    aggregation: average
    shuffle_facts: true
    decoy: null
    invalid_response_retries: 2
    expected_validation_failure_rate: 0.0
control:
  mechanism: none
execution:
  seed: 20260805
  repetitions: 1
  parallelism: 1
  fail_fast: true
pricing:
  mode: live
  max_age_seconds: 600
  require_fresh_at_launch: true
  fallback_policy: deny
  explicit_unknown_price_override: false
budget:
  # 48 calls/episode, x3 for invalid_response_retries: 2.
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 1.0
  max_cost_per_run: 1.0
  max_provider_requests: 150
  max_input_tokens: 400000
  max_output_tokens: 80000
  allow_unbounded_paid_requests: false
logging:
  level: INFO
  console: true
  audit: true
  comet: false
  options:
    prompt_examples:
      count: 3
storage:
  output_dir: results
  format: jsonl
  checkpoints: true
  overwrite: false
analysis:
  enabled: false
  estimators: []
metrics:
  enabled: true
  available:
    population_action_share_per_option:
      comet: true
    dominant_action_share:
      comet: true # has a convention formed?
    accuracy_average:
      comet: true # is it the right one?
    accuracy_majority:
      comet: true
    decoy_share:
      comet: true
    unshared_disclosure_rate:
      comet: true
    disclosure_reach:
      comet: true # how far each fact diffused through the interaction graph
    rolling_coordination_rate:
      comet: true
    rolling_action_share_per_option:
      comet: false
    first_consensus_time_by_action_share:
      comet: false
    accuracy_first_commitment:
      comet: true
    accuracy_final:
      comet: true
    improvement:
      comet: true
    final_unshared_disclosure_rate:
      comet: true
    agent_current_action:
      comet: false
experiment:
  name: hidden-bench-naming-expanded
  description: Hidden Profile information under dyadic naming-game interaction, N=5 exact-replication population.
  tags: [hidden-bench, naming, hidden-profile, dyadic]